In [13]:
import pandas as pd

In [18]:
lst=["nisha",89,90,9]
new=pd.DataFrame(lst)

In [19]:
new

       0
0  nisha
1     89
2     90
3      9

In [3]:
df=pd.DataFrame([[2,3,4],[3,5,6],[5,6,8]],index=[1,2,3],columns=["first","second","three"])

In [4]:
df

   first  second  three
1      2       3      4
2      3       5      6
3      5       6      8

In [5]:
df.loc[:,"first"]  # Access a group of rows and columns by
                    # label(s) or a boolean array.
    
    # only column name is given

1    2
2    3
3    5
Name: first, dtype: int64

In [6]:
df.loc[1,"first"]   # row and column both are given

2

In [7]:
df.loc[1,:]         # only row or index is given

first     2
second    3
three     4
Name: 1, dtype: int64

In [8]:
df.loc[:,:]

   first  second  three
1      2       3      4
2      3       5      6
3      5       6      8

In [8]:
df.loc[[1,2],"first"]

1    2
2    3
Name: first, dtype: int64

In [9]:
df.loc[1:3,["first","second"]]

   first  second
1      2       3
2      3       5
3      5       6

In [10]:
df.loc[:,"first":"three"]

   first  second  three
1      2       3      4
2      3       5      6
3      5       6      8

In [23]:
df.drop("three",axis=1) # it doesn't affect the original dataframe until we store it into df or set inplace true

   first  second
1      2       3
2      3       5
3      5       6

In [24]:
df

   first  second  three
1      2       3      4
2      3       5      6
3      5       6      8

In [25]:
#df[df.first==2]

In [14]:
#df.loc[df.first==2, : ]

In [15]:
#df.loc[df.first==2, : "second"]

In [16]:
df.iloc[:,[0,2]]  #it works on index and treat all columns by their indexing

   first  three
1      2      4
2      3      6
3      5      8

In [27]:
df.iloc[:,0:2]  #it only takes integer values

   first  second
1      2       3
2      3       5
3      5       6

In [28]:
df.iloc[0:2,0:2]

   first  second
1      2       3
2      3       5

In [29]:
df[["first","three"]]

   first  three
1      2      4
2      3      6
3      5      8

In [30]:
#df["first","second","three"]  gives an error

In [31]:
df

   first  second  three
1      2       3      4
2      3       5      6
3      5       6      8

In [32]:
df.ix[1,"first"]

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

2

In [35]:
df.ix[1,["first","three"]]

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

first    2
three    4
Name: 1, dtype: int64

In [34]:
df.ix[1:3,"first"]

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

1    2
2    3
3    5
Name: first, dtype: int64